---
kind: type
id: T:Autodesk.Revit.DB.RevitLinkOptions
source: html/3f710983-5a4d-d515-a633-12b06a419b30.htm
---
# Autodesk.Revit.DB.RevitLinkOptions

This class contains the options in use when creating
 or loading a Revit link.

## Syntax (C#)
```csharp
public class RevitLinkOptions : IDisposable
```